note/2020/view-local-html-manual-in-helpful-(part-2)/index.org
#+SETUPFILE: ../../setup.org
#+TITLE: View Local HTML Manual in Helpful (Part 2)
#+DATE: <2020-03-19 Thu 15:10>
#+TAGS: Emacs

After the first post about viewing manuals, Chunyang setup a GitHub repository that automatically compiles versioned Emacs manual  and serves them on GitHub Pages: [[https://github.com/xuchunyang/emacs-manuals][repo]]. This is a fantastic idea. I mean, who doesn’t like spending Microsoft’s money? I forked his repository and added some of my own CSS styling to make the manual look even nicer (for me). [[https://archive.casouri.cat/emacs-manuals/][View it here]].

The updated code for opening this Microsoft-sponsored manual:
#+begin_src emacs-lisp
(defvar helpful-html-manual-base-url "https://archive.casouri.cat/emacs-manuals/master/elisp"
  "Base URL for the online manual. No trailing slash.")

(define-minor-mode helpful-html-manual-mode
  "View HTML manuals in helpful."
  :lighter ""
  :global t
  (if helpful-html-manual-mode
      (advice-add #'helpful--manual :override #'helpful--html-manual)
    (advice-remove #'helpful--manual #'helpful--html-manual)))

(defun helpful--html-manual (button)
  "Open the HTML manual for the symbol that this BUTTON represents."
  (let* ((sym (symbol-name (button-get button 'symbol)))
         (manual-file (format "%s.html" (capitalize sym))))
    (browse-url
     (format "%s/%s" helpful-html-manual-base-url manual-file))))
#+end_src
