note/2020/view-local-html-manual-in-helpful-(part-2)/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-19 Thu 15:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>View Local HTML Manual in Helpful (Part 2)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up-index-page">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../index.html"> HOME </a>
</div>
<div>
<a href="../rss.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> |
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div><div id="content">
<h1 class="title">View Local HTML Manual in Helpful (Part 2)</h1>
<p>
After the first post about viewing manuals, Chunyang setup a GitHub repository that automatically compiles versioned Emacs manual  and serves them on GitHub Pages: <a href="https://github.com/xuchunyang/emacs-manuals">repo</a>. This is a fantastic idea. I mean, who doesn’t like spending Microsoft’s money? I forked his repository and added some of my own CSS styling to make the manual look even nicer (for me). <a href="https://archive.casouri.cat/emacs-manuals/">View it here</a>.
</p>

<p>
The updated code for opening this Microsoft-sponsored manual:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #e45649;">defvar</span> <span style="color: #6a1868;">helpful-html-manual-base-url</span> <span style="color: #50a14f;">"https://archive.casouri.cat/emacs-manuals/master/elisp"</span>
  <span style="color: #9ca0a4; font-style: italic;">"Base URL for the online manual. No trailing slash."</span>)

(<span style="color: #e45649;">define-minor-mode</span> <span style="color: #a626a4;">helpful-html-manual-mode</span>
  <span style="color: #9ca0a4; font-style: italic;">"View HTML manuals in helpful."</span>
  <span style="color: #a626a4;">:lighter</span> <span style="color: #50a14f;">""</span>
  <span style="color: #a626a4;">:global</span> t
  (<span style="color: #e45649;">if</span> helpful-html-manual-mode
      (advice-add #'helpful--manual <span style="color: #a626a4;">:override</span> #'helpful--html-manual)
    (advice-remove #'helpful--manual #'helpful--html-manual)))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">helpful--html-manual</span> (button)
  <span style="color: #9ca0a4; font-style: italic;">"Open the HTML manual for the symbol that this BUTTON represents."</span>
  (<span style="color: #e45649;">let*</span> ((sym (symbol-name (button-get button 'symbol)))
         (manual-file (format <span style="color: #50a14f;">"%s.html"</span> (capitalize sym))))
    (browse-url
     (format <span style="color: #50a14f;">"%s/%s"</span> helpful-html-manual-base-url manual-file))))
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Written by Yuan Fu <<a href="mailto:casouri@gmail.com">casouri@gmail.com</a>></p>
<p class="first-publish">First Published on 2020-03-19 Thu 15:10</p>
<p class-"last-modified">Last modified on 2020-03-19 Thu 15:21</p>
</div>
</body>
</html>
